/*
 * Задание по программированию «A + B»
 * На вход программе через стандартный ввод передаются два целых числа, по модулю не превышающие 100000. Выведите в
 * стандартный вывод их сумму.
 * https://stepik.org/lesson/283164/step/9?auth=login&unit=264468 *
 */

#include <iostream>

using namespace std;

int main()
{
  int a, b;
  cin >> a >> b;
  cout << a + b << endl;
  return 0;
}
